{
  "A": {
    "personality_type": "Vigilant",
    "unmanaged_disorder": "Paranoid",
    "main_interest": "maintaining autonomy",
    "description": "Nothing escapes the notice of the men and women who have Vigilant personality style. These individuals possess an exceptional awareness of their environment. Call them Survivors. Their sensory antennae, continuously scanning the people and situations around them, alert them immediately to what is awry, out of place, dissonant, or dangerous, especially in their dealings with other people. Vigilant types have a special kind of hearing. They are immediately aware of the mixed messages, the hidden motivations, the evasions, and the subtlest distortions of the truth that elude or delude less gifted observers. With such a focus, Vigilant individuals naturally assume the roles of social critic, watchdog, ombudsman, and crusader in their private or our public domain, ready to spring upon the improprieties -- especially the abuses of power -- that poison human affairs.",
    "bullet_points": [
      "Autonomy. Vigilant-style individuals possess a resilient independence. They keep their own counsel, they require no outside reassurance or advice, they make decisions easily, and they can take care of themselves.",
      "Caution. They are careful in their dealings with others, preferring to size up a person before entering into a relationship.",
      "Perceptiveness. They are good listeners, with an ear for subtlety, tone, and multiple levels of communication.",
      "Self-defense. Individuals with Vigilant style are feisty and do not hesitate to stand up for themselves, especially when they are under attack.",
      "Alertness to criticism. They take criticism very seriously, without becoming intimidated.",
      "Fidelity. They place a high premium on fidelity and loyalty. They work hard to earn it, and they never take it for granted."
    ]
  },
  "B": {
    "personality_type": "Solitary",
    "unmanaged_disorder": "Schizoid",
    "main_interest": "finding solitude",
    "description": "Solitary men and women need no one but themselves. They are unmoved by the madding crowd, liberated from the drive to impress and to please. Solitary people are remarkably free of the emotions and involvements that distract so many others. What they may give up in terms of sentiment and intimacy, however, they may gain in clarity of vision. Left to their own devices, Solitary anthropologists, naturalists, mathematicians, physical scientists, filmmakers, writers, and poets, can uncover and record the facts of our existence to which our passions so often blind us.",
    "bullet_points": [
      "Solitude. Individuals with the Solitary personality style have small need of companionship and are most comfortable alone.",
      "Independence. They are self-contained and do not require interaction with others in order to enjoy their experiences or to get on in life.",
      "Sangfroid. Solitary men and women are even-tempered, calm, dispassionate, unsentimental, and unflappable.",
      "Stoicism. They display an apparent indifference to pain and pleasure.",
      "Sexual composure. They are not driven by sexual needs. They enjoy sex but will not suffer in its absence.",
      "Feet on the ground. They are unswayed by either praise or criticism and can confidently come to terms with their own behavior."
    ]
  },
  "C": {
    "personality_type": "Idiosyncratic",
    "unmanaged_disorder": "Schizotypical",
    "main_interest": "nonconforming",
    "description": "Idiosyncratic men and women are not like anyone else. They are dreamers, seekers of the spirit, visionaries, mystics. They march to a distinctive beat, different from the conventional rhythms that most people follow. They are true originals and often they stand out, sometimes as eccentrics, sometimes as geniuses.",
    "bullet_points": [
      "Inner life. Idiosyncratic individuals are tuned in to and sustained by their own feelings and belief systems, whether or not others accept or understand their particular worldview or approach to life.",
      "Own world. They are self-directed and independent, requiring few close relationships.",
      "Own thing. Oblivious to convention, Idiosyncratic individuals create interesting, unusual, often eccentric lifestyles.",
      "Expanded reality. Open to anything, they are interested in the occult, the extrasensory, and the supernatural.",
      "Metaphysics. They are drawn to abstract and speculative thinking.",
      "Outward view. Though they are inner-directed and follow their own hearts and minds, Idiosyncratic men and women are keen observers of others, particularly sensitive to how other people react to them."
    ]
  },
  "D": {
    "personality_type": "Adventurous",
    "unmanaged_disorder": "Antisocial",
    "main_interest": "facing challenges",
    "description": "Throw caution to the winds -- here comes the Adventurer. Who but Adventurers would have taken those long leaps for mankind -- crossed the oceans, broken the sound barrier, walked on the moon? The men and women with this personality style venture where most mortals fear to tread. They are not bound by the same terrors and worries that limit most of us. They live on the edge, challenging boundaries and restrictions, pitting themselves for better or for worse in a thrilling game against their own mortality. No risk, no reward, they say. Indeed, for people with the Adventurous personality style, the risk is the reward.",
    "bullet_points": [
      "Nonconformity. Men and women who have the Adventurous personality style live by their own internal code of values. They are not strongly influenced by other people or by the norms of society.",
      "Challenge. To live is to dare. Adventurers love the thrill of risk and routinely engage in high-risk activities.",
      "Mutual independence. They do not worry too much about others, for they expect each human being to be responsible for him- or herself.",
      "Persuasiveness. They are silver-tongued, gifted in the gentle art of winning friends and influencing people.",
      "Wanderlust. They love to keep moving. They settle down only to have the urge to pick up and go, explore, move out, move on. They do not worry about finding work, and live well by their talents, skills, ingenuity, and wits.",
      "Wild oats. In their childhood and adolescence, people with the Adventurous personality style were usually high-spirited hell-raisers and mischief makers.",
      "True grit. They are courageous, physically bold, and tough. They will stand up to anyone who dares to take advantage of them.",
      "No regrets. Adventurers live in the present. They do not feel guilty about the past or anxious about the future. Life is meant to be experienced now."
    ]
  },
  "E": {
    "personality_type": "Mercurial",
    "unmanaged_disorder": "Borderline",
    "main_interest": "maintaining relationships",
    "description": "Life is a roller coaster for those with the Mercurial personality style -- and they'll insist you come along for the ride. From the peaks to the valleys, intensity imbues their every breath. Mercurial women and men yearn for experience, and they jump into a new love or a new lifestyle with both feet, without even a glance backward. No other style, the Dramatic included, is so ardent in its desire to connect with life and with other people. And no other style is quite so capable of enduring the changes in emotional weather that such a fervidly lived life will bring.",
    "bullet_points": [
      "Romantic attachment. Mercurial individuals must always be deeply involved in a romantic relationship with one person.",
      "Intensity. They experience a passionate, focused attachment in all their relationships. Nothing that goes on between them and other people is trivial, nothing taken lightly.",
      "Heart. They show what they feel. They are emotionally active and reactive. Mercurial types put their hearts into everything.",
      "Unconstraint. They are uninhibited, spontaneous, fun-loving, and undaunted by risk.",
      "Activity. Energy marks the Mercurial style. These individuals are lively, creative busy, and engaging. They show initiative and can stir others to activity.",
      "Open mind. They are imaginative and curious, willing to experience and experiment with other cultures, roles, and value systems and to follow new paths.",
      "Alternate states. People with Mercurial style are skilled at distancing or distracting themselves from reality when it is painful or harsh."
    ]
  },
  "F": {
    "personality_type": "Dramatic",
    "unmanaged_disorder": "Histrionic",
    "main_interest": "getting attention",
    "description": "Dramatic types are all heart. They have been granted the gift of feeling, with which they color the lives of everyone around them. When possessed of great talent, Dramatic men and women can transform human emotion into the highest art form. Even in their daily lives, their wit, their laughter, their sense of beauty, their flamboyance, and their sensuality can lift the spirits of a roomful of strangers. All the world's a stage for individuals with this very common personality style. Life is never dull or boring for them and certainly not for those who share it with them. Dramatic people fill their world with excitement; things happen in their lives.",
    "bullet_points": [
      "Feelings. Dramatic men and women live in an emotional world. They are sensation oriented, emotionally demonstrative, and physically affectionate, They react emotionally to events and can shift quickly from mood to mood.",
      "Color. They experience life vividly and expansively. They have rich imaginations, they tell entertaining stories, and they are drawn to romance and melodrama.",
      "Attention. Dramatic people like to be seen and noticed. They are often the center of attention, and they rise to the occasion when all eyes are on them.",
      "Appearance. They pay a lot of attention to grooming, and they enjoy clothes, style, and fashion.",
      "Sexual attraction. In appearance and behavior, Dramatic individuals enjoy their sexuality. They are seductive, engaging, charming tempters and temptresses.",
      "Engagement. Easily putting their trust in others, they are able to become quickly involved in relationships.",
      "The spirit is willing. People with Dramatic personality style eagerly respond to new ideas and suggestions from others."
    ]
  },
  "G": {
    "personality_type": "Self-confident",
    "unmanaged_disorder": "Narcissistic",
    "main_interest": "being successful",
    "description": "Self-Confident individuals stand out. They're the leaders, the shining lights, the attention-getters in their public or private spheres. Theirs is a star quality born of self-regard, self-respect, self-certainty -- all those self words that denote a faith in oneself and a commitment to one's self-styled purpose. Combined with the ambition that marks this style, that magical self-regard can transform idle dreams into real accomplishment. The Self-Confident personality style is one of the two most goal-directed of all fourteen (the other is the Aggressive style). Self-Confident men and women know what they want, and they get it. Many of them have the charisma to attract plenty of others to their goals. They are extroverted and intensely political. They know how to work the crowd, how to motivate it, and how to lead it. Hitch on to their bandwagons, and you'll be rewarded. The Self-Confident style adds go-getting power to other personality styles. For example, it counteracts the Conscientious person's tendency to get sidetracked by details, and it fuels the Adventurous person's great feats of daring. It propels any persoanlity pattern into the realm of success. Indeed, the Self-Confident style confers an ability to be successful more than any but the Aggressive personality style.",
    "bullet_points": [
      "Self-regard. Self-Confident individuals believe in themselves and in their abilities. They have no doubt that they are unique and special and that there is a reason for their being on this planet.",
      "The red carpet. They expect others to treat them well at all times.",
      "Ambition. Self-Confident people are unabashedly open about their aspirations and possibilities.",
      "Politics. They are able to take advantage of the strengths and abilities of other people in order to achieve their goals, and they are shrewd in their dealings with others.",
      "Competition. They are able competitors, they love getting to the top, and they enjoy staying there.",
      "Stature. They identify with people of high rank and status.",
      "Dreams. Self-Confident individuals are able to visualize themselves as the hero, the star, the best in their role, or the most accomplished in their field.",
      "Self-awareness. These individuals have a keen awareness of their thoughts and feelings and their overall inner state of being.",
      "Poise. People with the Self-Confident personality style accept compliments, praise, and admiration gracefully and with self-possession."
    ]
  },
  "H": {
    "personality_type": "Sensitive",
    "unmanaged_disorder": "Avoidant",
    "main_interest": "being accepted",
    "description": "Sensitive people come into possession of their powers when their world is small and they know the people in it. For this commonly occurring personality style, familiarity breeds comfort, contentment, and inspiration. These men and women -- although they avoid a wide social network and shun celebrity -- can achieve great recognition for their creativity. Nestled in an emotionally secure environment, with a few dear family members or friends, the Sensitive style's imagination and spirit of exploration know no bounds. With their minds, feelings, and fantasies, Sensitive people find freedom.",
    "bullet_points": [
      "Familiarity. Individuals with the Sensitive personality style prefer the known to the unknown. They are comfortable with, even inspired by, habit, repetition, and routine.",
      "Concern. Sensitive individuals care deeply about what other people think of them.",
      "Circumspection. They behave with deliberate discretion in their dealings with others. They do not make hasty judgments or jump in before they know what is appropriate.",
      "Polite reserve. Socially they take care to maintain a courteous, self-restrained demeanor.",
      "Role. They function best in scripted settings, vocationally and socially: when they know precisely what is expected of them, how they are supposed to relate to others, and what they are expected to say.",
      "Privacy. Sensitive men and women are not quick to share their innermost thoughts and feelings with others, even those they know well."
    ]
  },
  "I": {
    "personality_type": "Devoted",
    "unmanaged_disorder": "Dependent",
    "main_interest": "being helped",
    "description": "Devoted types care, and that's what makes their lives worth living. You won't find anyone more loving, more solicitous of you, more concerned for your needs and feelings or for those of a group as a whole. At their best, individuals with this style are loyal, considerate, ever-so-helpful players on the team -- whether it is a couple, the family, the assembly line, the department, the religious or charitable organization, or the military unit. Their needs are those of the group or of its leader, and their happiness comes from the fulfillment of others' directives and goals. Devoted people are the ones who tell you, \"I'm happy if you're happy\" -- and mean it. The Devoted style is common in our society, and it occurs among both men and women. Traditionally this helping and giving personality style has been particularily encouraged and approved among women. The customary view of the good wife has been that of a tender-hearted Devoted woman who lives through her husband and relies on him to make the worldly decisions for her, while she dedicates herself to providing a fulfilling home life for the family. As views of women's roles change in this society, some women with this personality style may have mixed feelings about expressing it. Because of today's cultural pressures on women to step out of the shadows of other people, both in and out of the home, they may feel that wanting to make someone else happy is something to be ashamed of. While these women struggle to come to terms with all sides of their personality patterns, more men are feeling freer to enjoy their own domestic, nurturing Devoted tendencies. In any case, as we will see throughout this chapter, the Devoted personality plays itself out in many ways in the personality profiles of males as well as females, traditional and otherwise.",
    "bullet_points": [
      "Commitment. Individuals with the Devoted personality style are thoroughly dedicated to the relationships in their lives. They place the highest value on sustained relationships, they respect the institution of marriage as well as unofficial avowals of commitment, and they work hard to keep their relationships together.",
      "Togetherness. They prefer the company of one or more people to being alone.",
      "Teamwork. People with this personality style would rather follow than lead. They are cooperative and respectful of authority and institutions. They easily rely on others and take direction well.",
      "Deference. When making decisions, they are happy to seek out others' opinions and to follow their advice.",
      "Harmony. Devoted individuals are careful to promote good feelings between themselves and the important people in their lives. To promote harmony, they tend to be polite, agreeable, and tactful.",
      "Consideration. They are thoughtful of others and good at pleasing them. Devoted people will endure personal discomfort to do a good turn for the key people in their lives.",
      "Attachment. Relationships provide life's meaning for this personality style. Even after a painful loss of someone around whom their life was centered, they are able to form new meaningful bonds."
    ]
  },
  "J": {
    "personality_type": "Conscientious",
    "unmanaged_disorder": "Obsessive-Compulsive",
    "main_interest": "achieving things",
    "description": "Call them the backbone of America. Conscientious-style people are the men and women of strong moral principle and absolute certainty, and they won't rest until the job is done and done right. They are loyal to their families, their causes, and their superiors. Hard work is a hallmark of this personality style; Conscientious types achieve. No accomplished doctor, lawyer, scientist, or business executive could get far without a substantial amount of Conscientious style in his or her personality pattern. Neither could a computer whiz, an efficient housekeeper, an accountant, a straight-A student, a good secretary -- or anyone else who works hard to do well. The Conscientious personality style flourishes within cultures such as ours in which the work ethic thrives. Conscientious traits -- hard work, prudence, conventionality -- may even confer a longevitity advantage. We address this style first among the fourteen because the Conscientious style is adaptable, common, and thus likely to be a principal component of many diverse personality profiles. Indeed, within our society so wide a range of Conscientious behaviors is considered normal, even admirable, that it may be hard to draw the line between the Conscientious personality style and the Obsessive-Compulsive personality disorder (p. 77) that marks its extreme. What are we to say about the man or woman who always takes a briefcase filled with work along on a vacation? Is he or she a workaholic who can't relax and is headed for an early heart attack? Or this a person who loves to work, thrives on challenge, and is bound for great things in his or her career? That depends on whether the style enriches the six domains of this person's life or controls and distorts them.",
    "bullet_points": [
      "Hard work. The Conscientious person is dedicated to work, works very hard, and is capable of intense, single-minded effort.",
      "The right thing. To be Conscientious is to be a person of conscience. These are men and women of strong moral principles and values. Opinions and beliefs on any subject are rarely held lightly. Conscientious individuals want to do the right thing.",
      "The right way. Everything must be done \"right,\" and the Conscientious person has a clear understanding of what that means, from the correct way to balance the checkbook, to the best strategy to achieve the boss's objectives, to how to fit every single dirty dish into the dishwasher.",
      "Perfectionism. The Conscientious person likes all tasks and projects to be complete to the final detail, without even minor flaws.",
      "Perseverance. They stick to their convictions and opinions. Opposition only serves to strengthen their dogged determination.",
      "Order and detail. Conscientious people like the appearance of orderliness and tidiness. They are good organizers, catalogers, and list makers. No detail is too small for Conscientious consideration.",
      "Prudence. Thrifty, careful, and cautious in all areas of their lives, Conscientious individuals do not give in to reckless abandon or wild excess.",
      "Accumulation. A \"pack rat,\" the Conscientious person saves and collects things, reluctant to discard anything that has, formerly had, or someday may have value for him or her."
    ]
  },
  "K": {
    "personality_type": "Leisurely",
    "unmanaged_disorder": "Passive-Aggressive",
    "main_interest": "doing as you please",
    "description": "Free to be me -- no one can take away this right from a person who has a Leisurely personality style. These men and women play by the rules and fulfill their responsibilities and obligations. But once they've put in their time, they will let no person, institution, or culture deprive hem of their personal pursuit of happiness, for to the Leisurely person this is what life is all about. Some Leisurely individuals find their happiness through creative pursuits, some by relaxing with a good book. What's important to them is not how they choose to enjoy themselves but that they are guaranteed this opportunity. If threatened, these normally easy-going individuals will vigorously defend their fundamental right to do their \"own thing\".",
    "bullet_points": [
      "Inalienable rights. Leisurely men and women believe in their right to enjoy themselves on their own terms in their own time. They value and protect their comfort, their free time, and their individual pursuit of happiness.",
      "Enough is enough. They agree to play by the rules. They deliver what is expected of them and no more. They expect others to recognize and respect that limit.",
      "The right to resist. Leisurely individuals cannot be exploited. They can comfortably resist acceding to demands that they deem unreasonable or above and beyond the call of duty.",
      "MaÃ±ana. Leisurely men and women are relaxed about time. Unlike Type-A individuals, they are not obsessed by time urgency or the demands of the clock. To these individuals, haste makes waste and unnecessary anxiety. They are easygoing and optimistic that whatever needs to get done will get done, eventually.",
      "I'm okay. They are not overawed by authority. They accept themselves and their approach to life.",
      "Wheel of fortune. Leisurely people believe that they are just as good as everyone else and as entitled to the best things in life. They maintain that blind luck often accounts for who fares well and who fares poorly.",
      "Mixed feelings. Although they feel impelled to proceed in their own direction, when their choices put them in conflict with the people they care for, Leisurely people are often of two minds about how to proceed. They do not like to risk important relationships, yet they need to feel free."
    ]
  },
  "L": {
    "personality_type": "Aggressive",
    "unmanaged_disorder": "Sadistic",
    "main_interest": "exercising power",
    "description": "Who's the boss? The Aggressive type, of course. While others may aspire to leadership, Aggressive men and women move instinctively to the helm. They are born to assume command as surely as is the top dog in their pack. Theirs is a strong, forceful personality style, more inherently powerful than any of the others. They can undertake huge responsibilities without fear of failure. They wield power with ease. They never back away from a fight. They compete with the supreme confidence of champions. How these individuals use the power that seems always at their fingertips depends on other styles in their patterns. When put to the service of a greater good, the Aggressive personality style can inspire a man or woman to great leadership, especially in times of crisis.",
    "bullet_points": [
      "Command. Aggressive individuals take charge. They are comfortable with power, authority, and responsibility.",
      "Hierarchy. They operate best within a traditional power structure where everyone knows his or her place and the lines of authority are clear.",
      "Tight ship. They are highly disciplined and impose rules of order that they expect others in their charge to follow.",
      "Expedience. Aggressive men and women are highly goal-directed. They take a practical, pragmatic approach to accomplishing their objectives. They do what is necessary to get the job done.",
      "Guts. They are neither squeamish nor fainthearted. They can function well and bravely in difficult and dangerous situations without being distracted by fear or horror.",
      "The rough-and-tumble. Aggressive people like action and adventure. They are physically assertive and often participate in or enjoy playing competitive sports, especially contact sports."
    ]
  },
  "M": {
    "personality_type": "Self-Sacrificing",
    "unmanaged_disorder": "Self-Defeating",
    "main_interest": "helping others",
    "description": "To live is to serve; to love is to give. These are axioms for individuals who have the Self-Sacrificing personality style. The way they see it, their needs can wait until others' are well-served. Knowing that they have given of themselves, they feel comfortable and at peace, secure with their place in the scheme of things. At its best and most noble, this is the selfless, magnanimous personality style of which saints and good citizens are made.",
    "bullet_points": [
      "Generosity. Individuals with the Self-Sacrificing personality style will give you the shirts off their backs if you need them. They do not wait to be asked.",
      "Service. Their \"prime directive\" is to be helpful to others. Out of deference to others, they are noncompetitive and unambitious, comfortable coming second, even last.",
      "Consideration. Self-Sacrificing people are always considerate in their dealings with others. They are ethical, honest, and trustworthy.",
      "Acceptance. They are nonjudgmental, tolerant of others' foibles, and never harshly reproving. They'll stick with you through thick and thin.",
      "Humility. They are neither boastful nor proud, and they're uncomfortable being fussed over. Self-Sacrificing men and women do not like being the center of attention; they are uneasy in the limelight.",
      "Endurance. They are long-suffering. They prefer to shoulder their own burdens in life. They have much patience and a high tolerance for discomfort.",
      "Artlessness. Self-Sacrificing individuals are rather naive and innocent. They are unaware of the often deep impact they make on other people's lives, and they tend never to suspect deviousness or underhanded motives in the people to whom they give so much of themselves."
    ]
  },
  "N": {
    "personality_type": "Serious",
    "unmanaged_disorder": "Depressive",
    "main_interest": "making a living",
    "description": "Serious men and women suffer no illusions. They don't hitch their wagons to a star, count their chickens before they're hatched, sing that life is just a bowl of cherries, or don rose-colored glasses to paint their existence a more beguiling hue. Even when things are not so pleasant, they seem them as they are. Of course, since the current culture favors individuals who \"think positive\", look on the bright side, and attempt to always improve themselves, somebody with a Serious style may not exactly fit the image. But Serious people don't expect to be popular. What they sacrifice in silver linings, they gain in ability to carry on in even the worst of circumstances. No other personality style is quite so able to endure when a harsh climate seems to descend on the planet. This is a no-frills, no-nonsense, just-do-it personality style, whose strength in hard times can help everyone survive. Like many of the other personality styles, it is one where a little goes a long way.",
    "bullet_points": [
      "I am straight faced. I have a sober demeanor. I am solemn.  I am not given to emotional expression.",
      "I have no pretensions. I am realistically aware of my own capabilities.  I am realistically aware of my own limitations. I am not tempted by vanity or self-importance.",
      "I am Accountable.  I am serious.  I hold myself responsible for their actions. I'm brutally honest about my own faults.  I do not let myslef off the hook.",
      "I'm in my element thinking, analyzing, evaluating and ruminating.  I always playing things over in my mind before I act.",
      "I'm nobody's fool. I sharply appraise others. In their ability to critique other people, they are as unhesitating as in their own self-evaluation.",
      "There are no surprises for me as I anticipate problems and when the worst happens, I'm prepared to deal with it.",
      "I am quickly contrite. I suffer greatly when I realize I've been thoughtless or impolite to others."
    ]
  }
}
